Piroro-hs/stm32f3xx-hal/src/gpio.rs
//! General Purpose Input / Output
//!
//! To use the GPIO pins, you first need to configure the GPIO port (GPIOA, GPIOB, ...) that you
//! are interested in. This is done using the [`GpioExt::split`] function.
//!
//! ```
//! let dp = pac::Peripherals::take().unwrap();
//! let rcc = dp.RCC.constrain();
//!
//! let mut gpioa = dp.GPIOA.split(&mut rcc.ahb);
//! ```
//!
//! The resulting [Parts](gpioa::Parts) struct contains one field for each
//! pin, as well as some shared registers.
//!
//! To use a pin, first use the relevant `into_...` method of the [pin](Pin).
//!
//! ```rust
//! let pa0 = gpioa.pa0.into_push_pull_output(&mut gpioa.moder, &mut gpioa.otyper);
//! ```
//!
//! And finally, you can use the functions from the [InputPin] or [OutputPin] traits in
//! `embedded_hal`
//!
//! For a complete example, see [examples/toggle.rs]
//!
//! [InputPin]: embedded_hal::digital::v2::InputPin
//! [OutputPin]: embedded_hal::digital::v2::OutputPin
//! [examples/toggle.rs]: https://github.com/stm32-rs/stm32f3xx-hal/blob/v0.6.0/examples/toggle.rs

use core::{convert::Infallible, marker::PhantomData};

use crate::{hal::digital::v2::OutputPin, pac::EXTI, rcc::AHB, syscfg::SysCfg};

#[cfg(feature = "unproven")]
use crate::hal::digital::v2::{toggleable, InputPin, StatefulOutputPin};

use cfg_if::cfg_if;
use typenum::{Unsigned, U0, U1, U10, U11, U12, U13, U14, U15, U2, U3, U4, U5, U6, U7, U8, U9};

/// Extension trait to split a GPIO peripheral in independent pins and registers
pub trait GpioExt {
    /// The Parts to split the GPIO peripheral into
    type Parts;

    /// Splits the GPIO block into independent pins and registers
    fn split(self, ahb: &mut AHB) -> Self::Parts;
}

/// GPIO Register interface traits private to this module
mod private {
    pub trait GpioRegExt {
        fn is_low(&self, i: u8) -> bool;
        fn is_set_low(&self, i: u8) -> bool;
        fn set_high(&self, i: u8);
        fn set_low(&self, i: u8);
    }

    pub trait Moder {
        fn input(&mut self, i: u8);
        fn output(&mut self, i: u8);
        fn alternate(&mut self, i: u8);
        fn analog(&mut self, i: u8);
    }

    pub trait Otyper {
        fn push_pull(&mut self, i: u8);
        fn open_drain(&mut self, i: u8);
    }

    pub trait Ospeedr {
        fn low(&mut self, i: u8);
        fn medium(&mut self, i: u8);
        fn high(&mut self, i: u8);
    }

    pub trait Pupdr {
        fn floating(&mut self, i: u8);
        fn pull_up(&mut self, i: u8);
        fn pull_down(&mut self, i: u8);
    }

    pub trait Afr {
        fn afx(&mut self, i: u8, x: u8);
    }

    pub trait Gpio {
        type Reg: GpioRegExt + ?Sized;

        fn ptr(&self) -> *const Self::Reg;
        fn port_index(&self) -> u8;
    }
}

use private::{Afr, GpioRegExt, Moder, Ospeedr, Otyper, Pupdr};

/// Marker trait for GPIO ports
pub trait Gpio: private::Gpio {}

/// Marker trait for compile time defined GPIO ports
pub trait GpioStatic: Gpio {
    /// Associated MODER register
    type MODER: Moder;
    /// Associated OTYPER register
    type OTYPER: Otyper;
    /// Associated OSPEEDR register
    type OSPEEDR: Ospeedr;
    /// Associated PUPDR register
    type PUPDR: Pupdr;
}

/// Marker trait for pin number
pub trait Index {
    #[doc(hidden)]
    fn index(&self) -> u8;
}

impl<U> Index for U
where
    U: Unsigned,
{
    #[inline(always)]
    fn index(&self) -> u8 {
        Self::U8
    }
}

/// Marker trait for readable pin modes
pub trait Readable {}

/// Marker trait for slew rate configurable pin modes
pub trait OutputSpeed {}

/// Marker trait for active pin modes
pub trait Active {}

/// Runtime defined GPIO port (type state)
pub struct Gpiox {
    ptr: *const dyn GpioRegExt,
    index: u8,
}

impl private::Gpio for Gpiox {
    type Reg = dyn GpioRegExt;

    fn ptr(&self) -> *const Self::Reg {
        self.ptr
    }

    fn port_index(&self) -> u8 {
        self.index
    }
}

impl Gpio for Gpiox {}

/// Runtime defined pin number (type state)
pub struct Ux(u8);

impl Index for Ux {
    fn index(&self) -> u8 {
        self.0
    }
}

/// Input mode (type state)
pub struct Input;
/// Output mode (type state)
pub struct Output<OTYPE>(PhantomData<OTYPE>);
/// Alternate function (type state)
pub struct Alternate<AF, OTYPE>(PhantomData<AF>, PhantomData<OTYPE>);
/// Analog mode (type state)
pub struct Analog;

/// Push-pull output (type state)
pub struct PushPull;
/// Open-drain output (type state)
pub struct OpenDrain;

impl Readable for Input {}
impl Readable for Output<OpenDrain> {}
impl<OTYPE> OutputSpeed for Output<OTYPE> {}
impl<AF, OTYPE> OutputSpeed for Alternate<AF, OTYPE> {}
impl Active for Input {}
impl<OTYPE> Active for Output<OTYPE> {}
impl<AF, OTYPE> Active for Alternate<AF, OTYPE> {}

/// Slew rate configuration
pub enum Speed {
    /// Low speed
    Low,
    /// Medium speed
    Medium,
    /// High speed
    High,
}

/// Internal pull-up and pull-down resistor configuration
pub enum Resistor {
    /// Floating
    Floating,
    /// Pulled up
    PullUp,
    /// Pulled down
    PullDown,
}

/// GPIO interrupt trigger edge selection
pub enum Edge {
    /// Rising edge of voltage
    Rising,
    /// Falling edge of voltage
    Falling,
    /// Rising and falling edge of voltage
    RisingFalling,
}

/// Generic pin
pub struct Pin<GPIO, INDEX, MODE> {
    gpio: GPIO,
    index: INDEX,
    _mode: PhantomData<MODE>,
}

/// Fully erased pin
///
/// This moves the pin type information to be known
/// at runtime, and erases the specific compile time type of the GPIO.
/// It does only matter, that it is a GPIO pin with a specific MODE.
///
/// See [examples/gpio_erased.rs] as an example.
///
/// [examples/gpio_erased.rs]: https://github.com/stm32-rs/stm32f3xx-hal/blob/v0.6.0/examples/gpio_erased.rs
pub type PXx<MODE> = Pin<Gpiox, Ux, MODE>;

macro_rules! modify_at {
    ($xr:expr, $bits:expr, $i:expr, $val:expr) => {
        $xr.modify(|r, w| {
            w.bits(r.bits() & !(u32::MAX >> 32 - $bits << $bits * $i) | $val << $bits * $i)
        });
    };
}

impl<GPIO, INDEX, MODE> Pin<GPIO, INDEX, MODE>
where
    INDEX: Unsigned,
{
    /// Erases the pin number from the type
    ///
    /// This is useful when you want to collect the pins into an array where you
    /// need all the elements to have the same type
    pub fn downgrade(self) -> Pin<GPIO, Ux, MODE> {
        Pin {
            gpio: self.gpio,
            index: Ux(INDEX::U8),
            _mode: self._mode,
        }
    }
}

impl<GPIO, MODE> Pin<GPIO, Ux, MODE>
where
    GPIO: GpioStatic,
    GPIO::Reg: 'static + Sized,
{
    /// Erases the port letter from the type
    ///
    /// This is useful when you want to collect the pins into an array where you
    /// need all the elements to have the same type
    pub fn downgrade(self) -> PXx<MODE> {
        PXx {
            gpio: Gpiox {
                ptr: self.gpio.ptr(),
                index: self.gpio.port_index(),
            },
            index: self.index,
            _mode: self._mode,
        }
    }
}

