Piroro-hs/stm32f3xx-hal/src/gpio.rs
impl<GPIO, INDEX, MODE> Pin<GPIO, INDEX, MODE> {
    fn into_mode<NEW_MODE>(self) -> Pin<GPIO, INDEX, NEW_MODE> {
        Pin {
            gpio: self.gpio,
            index: self.index,
            _mode: PhantomData,
        }
    }
}

impl<GPIO, INDEX, MODE> Pin<GPIO, INDEX, MODE>
where
    GPIO: GpioStatic,
    INDEX: Index,
{
    /// Configures the pin to operate as an input pin
    pub fn into_input(self, moder: &mut GPIO::MODER) -> Pin<GPIO, INDEX, Input> {
        moder.input(self.index.index());
        self.into_mode()
    }

    /// Convenience method to configure the pin to operate as an input pin
    /// and set the internal resistor floating
    pub fn into_floating_input(
        self,
        moder: &mut GPIO::MODER,
        pupdr: &mut GPIO::PUPDR,
    ) -> Pin<GPIO, INDEX, Input> {
        moder.input(self.index.index());
        pupdr.floating(self.index.index());
        self.into_mode()
    }

    /// Convenience method to configure the pin to operate as an input pin
    /// and set the internal resistor pull-up
    pub fn into_pull_up_input(
        self,
        moder: &mut GPIO::MODER,
        pupdr: &mut GPIO::PUPDR,
    ) -> Pin<GPIO, INDEX, Input> {
        moder.input(self.index.index());
        pupdr.pull_up(self.index.index());
        self.into_mode()
    }

    /// Convenience method to configure the pin to operate as an input pin
    /// and set the internal resistor pull-down
    pub fn into_pull_down_input(
        self,
        moder: &mut GPIO::MODER,
        pupdr: &mut GPIO::PUPDR,
    ) -> Pin<GPIO, INDEX, Input> {
        moder.input(self.index.index());
        pupdr.pull_down(self.index.index());
        self.into_mode()
    }

    /// Configures the pin to operate as a push-pull output pin
    pub fn into_push_pull_output(
        self,
        moder: &mut GPIO::MODER,
        otyper: &mut GPIO::OTYPER,
    ) -> Pin<GPIO, INDEX, Output<PushPull>> {
        moder.output(self.index.index());
        otyper.push_pull(self.index.index());
        self.into_mode()
    }

    /// Configures the pin to operate as an open-drain output pin
    pub fn into_open_drain_output(
        self,
        moder: &mut GPIO::MODER,
        otyper: &mut GPIO::OTYPER,
    ) -> Pin<GPIO, INDEX, Output<OpenDrain>> {
        moder.output(self.index.index());
        otyper.open_drain(self.index.index());
        self.into_mode()
    }

    /// Configures the pin to operate as an analog pin, with disabled schmitt trigger.
    pub fn into_analog(
        self,
        moder: &mut GPIO::MODER,
        pupdr: &mut GPIO::PUPDR,
    ) -> Pin<GPIO, INDEX, Analog> {
        moder.analog(self.index.index());
        pupdr.floating(self.index.index());
        self.into_mode()
    }
}

impl<GPIO, INDEX, MODE> Pin<GPIO, INDEX, MODE>
where
    GPIO: GpioStatic,
    INDEX: Index,
    MODE: OutputSpeed,
{
    /// Set pin output slew rate
    pub fn set_speed(&mut self, ospeedr: &mut GPIO::OSPEEDR, speed: Speed) {
        match speed {
            Speed::Low => ospeedr.low(self.index.index()),
            Speed::Medium => ospeedr.medium(self.index.index()),
            Speed::High => ospeedr.high(self.index.index()),
        }
    }
}

impl<GPIO, INDEX, MODE> Pin<GPIO, INDEX, MODE>
where
    GPIO: GpioStatic,
    INDEX: Index,
    MODE: Active,
{
    /// Set the internal pull-up and pull-down resistor
    pub fn set_internal_resistor(&mut self, pupdr: &mut GPIO::PUPDR, resistor: Resistor) {
        match resistor {
            Resistor::Floating => pupdr.floating(self.index.index()),
            Resistor::PullUp => pupdr.pull_up(self.index.index()),
            Resistor::PullDown => pupdr.pull_down(self.index.index()),
        }
    }

    /// Enables / disables the internal pull up (Provided for compatibility with other stm32 HALs)
    pub fn internal_pull_up(&mut self, pupdr: &mut GPIO::PUPDR, on: bool) {
        if on {
            pupdr.pull_up(self.index.index());
        } else {
            pupdr.floating(self.index.index());
        }
    }
}

impl<GPIO, INDEX, MODE> OutputPin for Pin<GPIO, INDEX, Output<MODE>>
where
    GPIO: Gpio,
    INDEX: Index,
{
    type Error = Infallible;

    fn set_high(&mut self) -> Result<(), Self::Error> {
        // NOTE(unsafe) atomic write to a stateless register
        unsafe { (*self.gpio.ptr()).set_high(self.index.index()) };
        Ok(())
    }

    fn set_low(&mut self) -> Result<(), Self::Error> {
        // NOTE(unsafe) atomic write to a stateless register
        unsafe { (*self.gpio.ptr()).set_low(self.index.index()) };
        Ok(())
    }
}

#[cfg(feature = "unproven")]
impl<GPIO, INDEX, MODE> InputPin for Pin<GPIO, INDEX, MODE>
where
    GPIO: Gpio,
    INDEX: Index,
    MODE: Readable,
{
    type Error = Infallible;

    fn is_high(&self) -> Result<bool, Self::Error> {
        Ok(!self.is_low()?)
    }

    fn is_low(&self) -> Result<bool, Self::Error> {
        // NOTE(unsafe) atomic read with no side effects
        Ok(unsafe { (*self.gpio.ptr()).is_low(self.index.index()) })
    }
}

#[cfg(feature = "unproven")]
impl<GPIO, INDEX, MODE> StatefulOutputPin for Pin<GPIO, INDEX, Output<MODE>>
where
    GPIO: Gpio,
    INDEX: Index,
{
    fn is_set_high(&self) -> Result<bool, Self::Error> {
        Ok(!self.is_set_low()?)
    }

    fn is_set_low(&self) -> Result<bool, Self::Error> {
        // NOTE(unsafe) atomic read with no side effects
        Ok(unsafe { (*self.gpio.ptr()).is_set_low(self.index.index()) })
    }
}

#[cfg(feature = "unproven")]
impl<GPIO, INDEX, MODE> toggleable::Default for Pin<GPIO, INDEX, Output<MODE>>
where
    GPIO: Gpio,
    INDEX: Index,
{
}

impl<GPIO, INDEX, MODE> Pin<GPIO, INDEX, MODE>
where
    GPIO: Gpio,
    INDEX: Index,
    MODE: Active,
{
    /// Make corresponding EXTI line sensitive to this pin
    pub fn make_interrupt_source(&mut self, syscfg: &mut SysCfg) {
        let i = self.index.index() % 4;
        let extigpionr = self.gpio.port_index() as u32;
        match self.index.index() {
            0..=3 => unsafe { modify_at!(syscfg.exticr1, 4, i, extigpionr) },
            4..=7 => unsafe { modify_at!(syscfg.exticr2, 4, i, extigpionr) },
            8..=11 => unsafe { modify_at!(syscfg.exticr3, 4, i, extigpionr) },
            12..=15 => unsafe { modify_at!(syscfg.exticr4, 4, i, extigpionr) },
            _ => unreachable!(),
        }
    }

    /// Generate interrupt on rising edge, falling edge, or both
    pub fn trigger_on_edge(&mut self, exti: &mut EXTI, edge: Edge) {
        cfg_if! {
            // if #[cfg(any(feature = "stm32f373", feature = "stm32f378"))] { // TODO: update after https://github.com/stm32-rs/stm32-rs/pull/496 released
            if #[cfg(not(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f334")))] {
                let rtsr = &exti.rtsr;
                let ftsr = &exti.ftsr;
            } else {
                let rtsr = &exti.rtsr1;
                let ftsr = &exti.ftsr1;
            }
        }
        match edge {
            Edge::Rising => unsafe {
                modify_at!(rtsr, 1, self.index.index(), 1);
                modify_at!(ftsr, 1, self.index.index(), 0);
            },
            Edge::Falling => unsafe {
                modify_at!(rtsr, 1, self.index.index(), 0);
                modify_at!(ftsr, 1, self.index.index(), 1);
            },
            Edge::RisingFalling => unsafe {
                modify_at!(rtsr, 1, self.index.index(), 1);
                modify_at!(ftsr, 1, self.index.index(), 1);
            },
        }
    }

    /// Enable external interrupts from this pin.
    pub fn enable_interrupt(&mut self, exti: &mut EXTI) {
        cfg_if! {
            // if #[cfg(any(feature = "stm32f373", feature = "stm32f378"))] { // TODO: update after https://github.com/stm32-rs/stm32-rs/pull/496 released
            if #[cfg(not(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f334")))] {
                let imr = &exti.imr;
            } else {
                let imr = &exti.imr1;
            }
        }
        unsafe { modify_at!(imr, 1, self.index.index(), 1) };
    }

    /// Disable external interrupts from this pin
    pub fn disable_interrupt(&mut self, exti: &mut EXTI) {
        cfg_if! {
            // if #[cfg(any(feature = "stm32f373", feature = "stm32f378"))] { // TODO: update after https://github.com/stm32-rs/stm32-rs/pull/496 released
            if #[cfg(not(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f334")))] {
                let imr = &exti.imr;
            } else {
                let imr = &exti.imr1;
            }
        }
        unsafe { modify_at!(imr, 1, self.index.index(), 0) };
    }

    /// Clear the interrupt pending bit for this pin
    pub fn clear_interrupt_pending_bit(&mut self) {
        cfg_if! {
            // if #[cfg(any(feature = "stm32f373", feature = "stm32f378"))] { // TODO: update after https://github.com/stm32-rs/stm32-rs/pull/496 released
            if #[cfg(not(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f334")))] {
                let pr = unsafe { &(*EXTI::ptr()).pr };
            } else {
                let pr = unsafe { &(*EXTI::ptr()).pr1 };
            }
        }
        unsafe { pr.write(|w| w.bits(1 << self.index.index())) };
    }

